{
  "introducao": {
    "boasVindas": "Sejam bem vindos ao tutorial de CSS da He4rt Developers. Ficamos muito felizes de você ter chegado até aqui no nosso curso! Estaremos trabalhando nos próximos passos para que você saia desse curso entendendo um básico para começar a utilizar CSS em suas aplicações Web. CSS, que foi criado em 1994 por Håkon Wium Lie e Bert Bos, praticamente foram os caras que revolucionaram tudo que se entendia por website e estilização a partir desse ano. O poder de formatar e estilizar dados de website sem precisar ficar criando inúmeras tags de HTML foi um marco na história do desenvolvimento web e até hoje o CSS se perpetua como sendo de extrema importância para os desenvolvedores mundo afora.",
    "comunicacao": "Como iremos inicialmente usar o Github para hospedar o curso, gostariamos de pedir para qualquer dúvida referente à alguma aula ou melhorias que você crie um ISSUE no nosso repositório, para que assim consigamos resolver e manter uma padronização de perguntas/respostas dentro do nosso projeto.",
    "oQueVocePrecisaSaber": [
      "O css faz parte da tríade básica do Frontend (Html, CSS e Javascript), onde cada linguagem possui seu importante papel. O Html atua na manipulação de todo o conteúdo que é visível em um site (imagens, textos, links e vários outros). O Javascript cuida de tudo que desempenha alguma ação, por exemplo, quando você habilita o DarkTheme de um site.", "E ai que entra em cena o nosso querido css, atuando como uma poderosíssima ferramenta que permite fazer desde estilizações básicas - como alterar a cor de um elemento - até animações e figuras geométricas. A última versão do Css (Css 3) permitiu que ele ficasse ainda mais poderoso, trazendo a possibilidade de fazer coisas ( antes feitas apenas com JavaScript ), de maneira simples. Dessa forma vários desenvolvedores deram preferência ao css para certos tipos de funcionalidades, devido a praticidade, uma vez que não se trata de uma linguagem de programação. "
    ],
    "oQueECss": "O CSS é uma sigla para Cascading Style Sheet, ou folhas de estilo em cascata. Eles servem para que nós possamos estilizar nossas páginas escritas em HTML, fazendo com que elas fiquem mais bonitas e agradáveis aos olhos dos usuários finais. O CSS surgiu por volta do ano de 1995, quando Håkon Wium Lie e Bert Bos apresentaram a proposta do Cascading Style Sheets, que rapidamente foi apoiada pela W3C.",
    "comoCssFunciona": "",
    "quaisAsVantagens": "Ao utilizarmos CSS nas nossas páginas, existem algumas vantagens que são percebidas em relação a quando usamos apenas o HTML puro nos nossos sites. Primeiramente, as páginas tomam forma, ficam mais agradáveis aos olhos e mais bonitas. Mas, além disso, o CSS também traz vantagens como a facilidade na replicação de estilos de páginas. Ao criarmos uma folha de estilo, podemos replicar ela pra diferentes documentos HTML, tendo um papel importante na reutilização e organização dos códigos em HTML.",
    "adicionandoCssNoHtml": ""
  }
}